{
  "posts":
  [
    {
      "title": "Where to begin?",
      "date": "September 10, 2025",
      "text": "<p>Yesterday I had to run some errands for the company—mostly driving around in my car, picking up material necessary for the product we're building. I really enjoy those drives because I get to spend anywhere from 40 minutes to even 2 hours just driving around the city, thinking about what I want to do with my music and this blog. While driving on the highway I thought: \"What can I really talk about? What’s too sensitive or offensive? What’s considered 'crossing the line'?\" Then I thought, \"Well, let’s start with something so f***ing crazy nobody would believe it. In the end, I already put that in the disclaimer today!\" Either way, I kept thinking it doesn’t matter if anyone else believes it. What matters is that at least <em>The Team</em> would know it’s true.</p><p>The year was 2005. I was 8 years old. We had just moved from my house in the middle of nowhere to somewhere a bit closer to society. It was a cold night—normal weather for the city I was living in. I was in my pajamas, ready to go to sleep with the shades open. To be honest, I felt comfortable like that, with the streetlights piercing through my window. I was ready to fall asleep, until I felt something in my mind—like some sort of external thought passing through it. Almost as if Professor Xavier himself was trying to read my mind. I spoke out loud: \"Hello… who are you?\" and a voice responded: \"Well, in your cousin’s house I’m known simply as Teacup.\" I’m translating roughly here; the actual conversation was in Spanish, and his name was <em>Tesito</em>—which literally means \"little tea.\" I just thought Teacup sounded better.</p><p>Anyway, it wasn’t as if I was just hearing a voice in my head. It was as if this voice was speaking <em>through</em> me. I was talking, but it wasn’t me talking—it was Teacup. \"Oh, hi,\" I responded, my tone more curious than scared, as if the feeling was somehow familiar. Later, Teacup introduced me to his friends: \"I wanted to introduce you to my friends Gamma and Lambda.\" Each one greeted me—again, through my own voice. I remember Gamma being full of energy, saying we were going to be the best of friends. There was a kind of resignation in her tone when she said that. Gamma reminded me: \"You already know me. Your cousin and sister talked about me—that I burned with a match back at your old house.\" I said, \"Oh yeah, that you burned every part of your body.\" She snapped back, annoyed: \"NO, I ONLY BURNED MY FINGERS!\" I wanted to laugh, but I stayed serious throughout the whole encounter.</p><p>Then Lambda spoke—shy, hesitant, almost whispering: \"Hi, I’m Lambda…\"</p><p>I think I’ll stop here and split this story into two parts. Not to drag it out, but because there’s still more to say and I’d rather not rush it. And honestly, I know how this must sound—like some made-up fantasy or the kind of story only a crazy person would keep repeating. I’ve told it before, and most people just don’t take it seriously. That’s fine. Believe it, don’t believe it—that’s up to you. For me, this is real. Writing it down here is just my way of giving it one more chance to be heard. And yeah, maybe part of me is doing this because I want my album to get somewhere. Maybe this whole thing is just me being pathetic and trying to get attention. Call it self-pity, call it promotion, call it whatever you want—I don’t really care anymore. At least you’re still reading.</p><p>P.S: Lambda, Gamma, Alpha, and Orion… please stay until the end. I promise it’s going to be worth your time.</p><p>- Nano</p>",
      "song": "<iframe data-testid=\"embed-iframe\" style=\"border-radius:12px\" src=\"https://open.spotify.com/embed/track/4xF4ZBGPZKxECeDFrqSAG4?utm_source=generator\" width=\"50%\" height=\"152\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe>"
    },
    {
      "title": "Welcome: DISCLAIMER",
      "date": "September 9, 2025",
      "text": "<p>Well, this is my personal blog, where I will be sharing my thoughts, experiences, and probably some respectful venting toward certain people whom I will not be naming explicitly. Also this is my way of \"promoting\" my new <strong><u>album</u></strong> by, God willing, early 2027. I think you can guess the title by now. Having said that, I want to point out a few things first:</p><p><strong>1.</strong> All the experiences and thoughts expressed in these future blog posts are only about 10% believable; however, the opinions I hold are, in my view, 100% true.</p><p><strong>2.</strong> As I mentioned, I will not be disclosing any personal information about these people. Instead, I’ve decided to identify them with Greek letters (Lambda, Gamma, Alpha, etc.). I think it’s best if you know a little about each person’s background to some extent (career, profession, family)—of course, without revealing too much private information.</p><p><strong>3.</strong> The people referred to by Greek letters are completely unrelated to my family, close friends, ex-girlfriends, co-workers, and so on. I will only mention people within this \"unknown\" personal circle, referred to as \"The Team\". So, if by coincidence you think that one of these people is you, let me just say: get your head out of the gutter. You are not on my mind at that moment. You’ll know who you are based on the Greek letter I use.</p><p>With that said, I hope you enjoy these stories. I also want to make it clear that I will not discuss these posts with anyone privately—because I don't have the time nor patience to discuss these personal matters.</p><p>Tommorrow I'll begin my personal, raw, emotional rambling and hoping no one will worry about it<p>- Nano</p>",
      "song": "<iframe data-testid=\"embed-iframe\" style=\"border-radius:12px\" src=\"https://open.spotify.com/embed/track/57iDDD9N9tTWe75x6qhStw?utm_source=generator&theme=0\" width=\"50%\" height=\"152\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe>"
    }
  ]
}