{
  "posts":
  [
    {
      "title": "The Day I met Mossad",
      "id": "the-day-i-ment-mossad",
      "date": "September 17, 2025",
      "post": "<p>Hello again, beautiful people.  I want to start by saying that it's been really nice just writing here—sharing my experiences throughout the day and other things I may release through this blog. Today, I think I'll start another story for you to enjoy! And yes, I'll probably divide this one into multiple parts, just like last time. I'd call this story more of a prequel to the one I told about the “psychic voices,” because what I'm going to tell you now feels like the beginning of everything that's been happening to me ever since.</p>\n\n<p>I have these cousins—the same cousins Teacup mentioned in the first story. (If this is your first time reading the blog, I recommend you check out the <a href=\"./archive/archive.html\">archive</a> section, or go directly to the specific blog with this <a href=\"./archive/archive.html#where-to-begin\">link</a>.) I'll call these cousins by other names: my older cousin <strong>Snake</strong> and his younger brother <strong>OG-Phi</strong>. Both of them are older than me, and honestly, they've always been some of the funniest people I've ever met. I'm proud to call them family. They're not related to me by blood, but since my mom was really good friends with their mom, I've always considered them my cousins.</p>\n\n<p>Snake is really smart, compassionate, and a total clown whenever we hang out. For context, he was about 12 years older than me, but it always felt amazing to spend time with him. Every joke he told made me laugh, and the way he poked fun at us (OG-Phi, my sister, and me) was hilarious. OG-Phi was also older than me—about 5 or 6 years—and I really enjoyed spending time with him too. My earliest memory of him is watching him play a Yu-Gi-Oh! PS1 game while Snake and my sister were in the kitchen with my mom and aunt. There was never a time when I didn't enjoy being with him. Not only was he as funny as Snake, but he was more emotional, at least in my opinion. Since I was the youngest, he would often tell me things he couldn't tell his family—just to get it off his chest—and he'd always end those stories with something funny.</p>\n\n<p>They were also the biggest dorks I could think of. They loved Pokémon, Magic: The Gathering, video games, and pretty much every “geeky” hobby out there. I also remember them having “Saint Seiya” figurines. They told me not to play with them because they were collectibles, not toys, and too fragile. Thanks to them, I think Metal Gear Solid became my favorite game series. I've been a fan of Hideo Kojima's work ever since—mostly because I remember them playing MGS3 and MGS4, and I loved watching.</p>\n\n<p>My cousins also practiced karate. I know OG-Phi eventually became a black belt, and I think Snake did too, though I only remember seeing his purple belt on display. Because of them, I also started karate at a young age—probably around 5 or 6. They also told me about this strange “technique” they used called “How to Make Tea.” I'm still not sure what the purpose of it was, but it seemed to be something between hypnosis and mentorship. Instead of calling you their pupil, you were their “tea.” Looking back, it sounds kind of twisted—like you were something to be consumed. They explained that this was the point: the technique was like ripping out your essence, like extracting tea from a bag.</p>\n\n<p>One day, OG-Phi was playing Dragon Ball while I watched. Out of nowhere, he screamed, “Stop it, Snake! I know what you're doing!” I burst out laughing because I had no idea what Snake was up to, and it just seemed so random. After laughing, OG-Phi looked at me with a smirk and said, “What are you laughing at?” I answered, “You!” He asked, “Do you think I'm funny?” I said, “Yes!” and kept laughing. Then he said, “You know what, Nano, I'm gonna make you my Pokéball.”</p>\n\n<p>I replied, “You mean your Pokémon?” He shook his head. “No. Do you know what ‘tea' means?” I said, “No, but it's something you and Snake talk about.” With pride in his voice, he continued, “That's what I'm gonna make you, but you don't know that yet. So for now, you're going to be my Pokéball.” I still couldn't understand what he meant, but then he asked me, “Are you an ADHDer?” I was confused: “I don't know what that means.” He explained, “Are you easily distracted? Do you have a hard time remembering simple things? Are you kind of clumsy?” I said, “Oh, yes. I'm like that.” He smiled proudly. “Super! Then you're going to be my Pokéball!” I asked again, “Okay… but what is tea?” He brushed it off: “Oh, that's nothing, don't worry about it.” I just replied, “Okay.”</p>\n\n<p>Later, he looked at me, almost concerned, as if I might judge him or feel hurt by being left hanging. He asked, “Do you trust me?” I answered with full emotion, “Yes!” Then he said, “And you know I'd never do anything to hurt you, right? And if I did, it would only be to make you laugh or have a good time, right?” A little confused, I replied, “You're my cousin, and I really don't think you've ever hurt me.” He smiled, and I noticed a small tear roll down his cheek. “Okay,” he said, “come with me. I want to introduce you to a friend. His name is Mossad.” I said, “Okay.” He turned off his PS2 and told me to follow him to the attic. When we got there, he pulled out two chairs—one for me and one for him. “Be calm,” he said, “because I'm about to do something crazy. I've done it before, but you don't remember.” He then pulled out a strange-looking cigarette. It wasn't white with a brown filter like usual, but wrapped in brownish paper, with something inside I couldn't recognize. Later, I realized it was weed. He looked at me and said, “I'm going to be you, Mossad.” Then he took a hit.</p>\n\n<p>I'll stop the story here, mainly to leave you with a little cliffhanger. What happens next is intense, and I think a lot of people might be curious about it. For now, I want to give you a breather. This also helps Gamma, Lambda, and the others in The Team understand what happened that fateful night—a night I'll talk about much later. As for some behind-the-scenes blog updates: I'm currently working on the comment section, and I'll be adding it soon (maybe even tonight). I'll keep you posted on Instagram! Thanks again for being part of this journey. Oh, and one last update: this Saturday, I'll be recording vocals for <strong>Lambda's Lullaby</strong>. By the end of next month, you'll be able to listen to it!</p>\n\n<p>- Nano</p>",
      "song": "<iframe data-testid=\"embed-iframe\" style=\"border-radius:12px\" src=\"https://open.spotify.com/embed/track/1RKUoGiLEbcXN4GY4spQDx?utm_source=generator\" width=\"50%\" height=\"152\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe>"
    },
    {
      "title": "Before dot4",
      "id": "before-dot4",
      "date": "September 16, 2025",
      "post": "<p><strong>DISCLAIMER:</strong> This post contains sensitive content that mentions suicide, addictions, and other mental health–related topics. If you find these subjects distressing, I recommend skipping this post.</p>\n\n<p>Hello, Network! I know I kept you waiting over the weekend thanks to the… mmm… let's call it the “charger debacle.” Anyway, I want to welcome you to a new blog post! This time, I'll give you a little introduction about myself and who I was before becoming dot4. But first, I want to wish a happy Independence Day to my Mexican readers! Unfortunately, I had to work during the holiday, so I'm writing this right now from the comfort of my office chair. Without further delay, let me introduce myself.</p>\n\n<p>First of all, I'm Nano! That's actually my childhood nickname—my real name is Mariano—but I really enjoy it when people call me Nano. I was born in Bolivia, but I have Mexican nationality through my mother. I wasn't an academically gifted kid, but I do consider myself smart to some extent. Still, I'm easily distracted and a bit slow at times. I'm that person who's constantly reminded to “think before you act” or “think before you speak.” I like to think of myself as helpful and considerate, always trying to cheer people up or support friends and coworkers. But honestly, sometimes I feel like the complete opposite. There are days where I couldn't care less if someone is having a bad time, or when I just feel too lazy to help. So yeah—it depends on the mood.</p>\n\n<p>This isn't my first attempt at making a living from music. From 2019 to 2023, I went by another stage name: <em>4tydev</em>. Why that name? Because I studied Software Engineering, so the “dev” came from “software development.” The “4ty,” pronounced “forty,” comes from the fact that if you write “NANO” with letters and numbers, you get N4N0 → 40. A long explanation for just a name, I know. I started making music in college, shortly after a breakup. One day I told myself: “You know what? I'll start making EDM.” I got out of bed and bought Ableton 10 Standard. Then I signed up for Masterclass and started watching deadmau5's course. I didn't finish it, to be honest, but it gave me the push I needed. Later, I took courses on Skillshare, Udemy, and YouTube, and eventually found Production Music Live, where I learned about arrangements and melodic house. After a few months, I released my first single on SoundCloud, called “6 Months Ago,” because it had been exactly six months since I decided to start making music. Sadly, you can't check it out anymore—I deleted most of 4tydev in 2023. However, the profile is still active on <a href=\"https://skiomusic.com/4tydev\">Skiomusic</a>, and I left two of my last songs on <a href=\"https://open.spotify.com/artist/2rovx7b8l5rvIseD0PmZ4V?si=3LufjdXKRkKf3TqPir1uVA\">Spotify</a>. I'll drop one of them below in the music card if you want to listen.</p>\n\n<p>So, why did I delete 4tydev? Honestly, I just stopped caring. At that time—my lowest point—I went through the biggest psychotic break of my life. My hallucinations told me to… well, to KMS. But my twisted logic said, “I'll do it my own way.” Instead, I “killed” a part of myself by deleting 4tydev. Around that period (and I can't believe I'm writing this publicly), I became addicted to weed. I smoked every day, almost every hour. It really messed me up. That's also why I made my disclaimer post a week ago—you don't have to believe anything I say here. I know no one would believe the “psychic voices” I had as a child, or the “Greek Letter” people I thought were real. After my third psychotic break, I feel like my brain may have been damaged permanently.</p>\n\n<p>During that time, my family grew to resent me. Some people even told me, “I don't ever want to know anything about you again,” and they meant it. I also lost contact with my best friends because of my attitude. I get it. Eventually, I went to rehab for four months. It was a terrible moment in my life, but looking back, Eminem's albums <em>Relapse</em> and <em>Recovery</em> really hit differently after that experience. “You're 26, but you act like you're 15.” And yeah—I did. Or maybe I still do. I don't know. I live with my mom, I don't pay rent or bills, and honestly, I'm not planning to. Does that make me inconsiderate? Like a teenager who refuses to grow up? Maybe. But hey, this blog is literally called “When Will I Start Giving a F**k?”—so you already know the answer.</p>\n\n<p>Well, that's it for today. See you tomorrow for the next blog. Oh, and one last note: I was thinking about adding a comment section, but in a different way. Instead of public comments, it would work more like a DM system—you'd write something, and it would be sent to my personal server. I like the idea, maybe with a “username” textbox if you want to share your name. Just brainstorming out loud.</p>\n\n<p>- Nano</p>",
      "song": "<iframe data-testid=\"embed-iframe\" style=\"border-radius:12px\" src=\"https://open.spotify.com/embed/track/7N25wm4w1XVoKjxHFIwclv?utm_source=generator\" width=\"50%\" height=\"152\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe>" 
    },
    {
      "title": "Pre-Lambda's Lullaby, my dear",
      "id": "pre-lambdas-lullaby-my-dear",
      "date": "September 15, 2025",
      "post": "<p>Hey guys, welcome back to another blogpost. I want to first apologize for yesterday's rambling and venting towards Lambda. I was writing down everything that came to mind in the moment, and I just felt like saying it. With that out of the way, I want to continue with the following reflection I've had.</p>\n\n<p>I've made excuses every time I wanted to do something big, mostly because of fear—fear of not being good enough, fear of being criticized, and fear of failing. Lambda is just pushing me to be better than I am now, and I get it. I've always been told I'm a man with a lot of potential, but that I don't take advantage of it. Every time I think of \"feeding the flames\" of my potential, I ultimately freeze. I tell myself I'm not good enough and that maybe I just have to keep living like this forever, staying in my comfort zone where I feel a bit safer. It's become such an ordeal for me to try and live up to my goals, and I use my age and my problems as excuses not to push forward. The truth is, I lack the discipline and courage to be who I want to be today—not tomorrow, but today. I'm hard on myself every day because I want greatness, even though a big part of me is too lazy to look toward a brighter future.</p>\n\n<p>I put pressure on myself to keep moving and achieve great things because I want to catch up with \"The Team.\" I want to be part of such an amazing family and group of friends who already live the life they worked so hard for. I admire and envy them so much that it has become a love–hate relationship. \"The Team\" is basically made up of stars, and I've been too afraid and embarrassed to follow them or join them on their adventure.</p>\n\n<p>You know what really bums me out? I can be an explosive person, and that's pushed people away from me—it's a bad habit. I've pushed \"The Team\" so far away that some of the people who were part of it are no longer around. A couple of weeks ago, Lambda told me, \"Two more people left,\" and I replied, \"I don't care. Good for them.\" I guess it's easier to push people away when you already see yourself in such a degrading way. Thinking, \"These people are better off without me,\" or \"I'm better off alone.\" And then comes the feeling that you've pushed them so far away, they'll never come back. Recently, I even sent follow requests to both <em>Girls of Han</em>, but of course, they both blocked me. I f**ked up. Those are the consequences of my actions, and it's still hard to accept the reality that I lost my best friends. Again, it goes back to me thinking I'm better off alone, that I don't need anyone, and that I suck as a friend and as a partner.</p>\n\n<p>I really, truly adore Lambda. She's funny, beautiful, and of course, talented. Many times I think, \"She's too good for me.\" While I'm still here on Earth, she's already surpassed the Milky Way. Yet she keeps fighting and pushing me to catch up with her, and honestly, it feels impossible. Even after all the arguments we've had and me telling her a million times: \"We are not going to be together, so get down from the clouds.\" It's not because I don't want to be with her—it's because I don't think I could live up to her expectations. That's also one of the reasons I fail in relationships: I always feel I'm not good enough for them. There's this song by Ha*Ash, a Mexican duo. I don't remember the name or how it goes exactly, but the end of the chorus says something like, \"It's not what you did, but what you stopped doing.\" That line hit me right in the heart.</p>\n\n<p>But yeah, that's it for this blogpost. Thanks for keeping up with this honest, reflective session! And hey, I just want to end on a high note—I've seen on my Instagram stats that 3–5 people visited this page, and I want to say thank you! At least I know the blog is catching people's attention, and that's absolutely great! I'll keep you posted on Instagram and here as always. Next time, I'll probably add a small \"comment\" section where you can share your opinions or just let something out. Hang in there—and this weekend I'm recording vocals for <strong>Lambda's Lullaby</strong>, so in the next few weeks I'll have some news on the new single! See you tomorrow!</p>\n\n<p>- Nano</p>",
      "song": "<iframe data-testid=\"embed-iframe\" style=\"border-radius:12px\" src=\"https://open.spotify.com/embed/track/6VWz99969QmNc2gWo21ktl?utm_source=generator\" width=\"50%\" height=\"152\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe>"
    },
    { 
      "title": "I Seriously Tried to Make This Lighter",
      "id": "i-seriously-tried-to-make-this-lighter",
      "date": "September 12, 2025",
      "post": "<p>Well, hello again, dear reader. Like I said, I'll keep this one a little lighter and just share what's on my mind right now.</p>\n\n<p>I'm writing this just before my music production and composition class at a private cultural center near my house. Honestly, I don't think anyone's showing up today. Maybe “music production” just sounds too intimidating for young teens. I've thought about renaming it to something friendlier, like “music building.” Or maybe we just need better promotion—flyers outside schools, or even ads on Facebook and Instagram so the course pops up for anyone, anytime. Still, I'm hanging on. This is already the second day with no students, but as the center's manager always says: “Hope is the last thing that dies.” In Spanish—“La esperanza es lo último que muere”—it hits even harder. And truthfully, I hold onto that every time I feel like quitting. When I'm drained, sad, and telling myself, “Everything is pointless. I'm 28, it's too late,” I remind myself: maybe things feel pointless right now, but hope is always the last thing that dies. I've been at this for six years, and at least today, at 28, I feel like I'm finally moving forward.</p>\n\n<p>Recently, I worked on a project that reminded me why I love this. My vocal coach asked me to record her students for International Children's Day, singing “Que Canten Los Niños” (“Let the Kids Sing”). It was amazing. Producing and editing each of the 12 kids' vocals was fun on its own, but when the chorus came in and ALL of them sang together… wow. It gave me chills. Being trusted with that project was so fulfilling, and it pushed me to finally start my own studio: <em><strong>Casa 4 Studio</strong></em> (pronounced “Casa Cuatro Studio”—though people can call it “House 4” if they prefer). I'm even remodeling a small family space to turn it into a real physical studio. That feels like progress.</p>\n\n<p>Still… Lambda doesn't get it. I know, I should work harder, stop making excuses, and push myself instead of drowning in pessimism. Believe me—I know! But can't you see where I am right now? You know the struggles I've lived through. Last year I barely did anything, and the little I did you brushed off. I don't care if “I'm better than this.” That's why I told you I can't even think about being with you. You're far away now, just a memory. And like I said before, it'll take as long as it takes—so please, just let me be. I'm sorry I didn't map out my life the way you did 20+ years ago. I get it—you had your first album at 14. Congrats. But while I was just learning to believe in myself six years ago, you were already celebrating platinum records. Just… let me be. When I release <strong>Lambda's Lullaby</strong>, I hope you'll finally understand instead of leaning on HEX every single time.</p>\n\n<p>Anyway, I'll stop here. And yes, I'm posting this as-is—no filters. Thanks for sticking around. As always, you can reach me on my socials (links are up top). See you tomorrow.</p>\n\n<p>- Nano</p>",
      "song": "<iframe data-testid=\"embed-iframe\" style=\"border-radius:12px\" src=\"https://open.spotify.com/embed/track/60a0Rd6pjrkxjPbaKzXjfq?utm_source=generator\" width=\"50%\" height=\"152\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe>"
    },
    {
      "title":"Where to begin? Part 2",
      "id":"where-to-begin-part-2",
      "date":"September 11, 2025",
      "post":"<p>Hey! Welcome back to the blog. If this is your first time reading, let me officially welcome you to the weird and fun world of dot4 (pronounced either \"dot four\" or \"dota\"—I still haven't decided, so take your pick). Here, I share absurd stories and experiences I've had over my 28 years of life on Earth. I also just added an \"archive\" page where you can check out older posts—follow this <strong><a href=\"./archive/archive.html\">link</a></strong> right here! If you've already read my last two posts, congratulations and thank you for keeping up with my chaos. For me, the most important thing is that you have fun while reading, because trust me—these stories only get crazier. So, without further ado, let's continue...</p>\n\n<p>I remember standing up from my bed and moving closer to the TV when I first met Teacup, Gamma, and Lambda. For me, changing positions felt like trying to make sense of what was happening. I needed a physical object, something to ground me, to “translate” these voices that were coming out of my own mouth. Almost like I had to simulate talking to someone. Anyway, as I said in the last post, when Lambda introduced herself, she had this shy energy—kind of like Hinata whenever she tried to talk to Naruto. I said, \"Hi Lambda. Are you going to be one of my best friends too?\" My tone was curious. She replied, \"Yes… well, kind of… I like you… maybe later on you could be my boyfriend.\"</p>\n\n<p>Looking back, I was shocked. It's not that I don't think I'm handsome enough to get a girlfriend, but in school—elementary, middle, and high school—I never saw myself as someone who instantly attracted girls. Yet, at that moment, I barely reacted. I think I smiled a little, but that was it. I said, \"Wow… but I don't know you, and you don't know me.\" She just smiled and said, \"I know you—through <em>The Girls of Han</em>.\" <em><strong>The Girls of Han</strong></em> were some close friends of mine. Then Lambda added, \"But they call me Polly,\" with this mysterious tone. I just looked at the floor and said, \"Okay...\" In hindsight, I probably should have asked, \"Why do you like me?\" because honestly, it's wild to think this \"Lambda\" supposedly had a crush on me for 20 years. I've never been the most confident or the kind of guy women fall for. Heck, I even get anxious ordering food at a restaurant. Maybe I'm exaggerating, but back then, before trying to rebrand myself as an artist, I couldn't even stand taking pictures of myself. If it were up to me, I'd only share graphics, drawings, and screen recordings of my sessions—because honestly, I've always hated the camera.</p>\n\n<p>Those were the last words Lambda and I exchanged… at least for a while. Then Teacup chimed in suddenly: \"Your father is still alive.\" I said, \"That's not true, he passed away last year… I went to his funeral, mass, everything.\" But without hesitation, Teacup replied, \"No, he isn't. But he's not a man anymore… she's a woman.\" Then this woman spoke: \"Hey Nano, it's me… I'm The Patriot.\" (That's just a pseudonym—I don't want to reveal too much here.) \"Dad?\" I asked. She responded flatly, \"No. Your dad died of a heart attack last year. I'm not your dad. You don't know me yet, but you will later.\" The way she said it felt hypnotic. My vision blurred, and green spots appeared everywhere. If you want a visual, Google \"Giygas Earthbound\"—those ghostly, terrifying faces moving around the screen. That's exactly what it felt like. Then she ordered, \"Go to the bathroom and look in the mirror.\"</p>\n\n<p>I stood up, shivering, terrified of what might happen. Slowly, a black frame closed in around my vision—like when a camera focuses and the borders darken. She said, \"Don't be afraid Nano! Calm down, okay? Nothing's going to happen. I'm just going to erase this memory from your head.\" She even said it jokingly, like it was a prank. And honestly, looking back, it kind of was. It reminded me of those spy movies where a random phrase activates a sleeper agent. That's what \"Teacup\" felt like—an activation word. Simple, strange, and kind of funny.</p>\n\n<p>I laughed nervously and said, \"Okay.\" She asked, \"You don't want to remember any of this, right?\" I answered, \"I actually don't mind.\" There was this comedic pause, then The Patriot said, \"I know, but I don't want to scare your mother. You don't want her worrying about silly things, right?\" \"Yeah, I guess not,\" I replied. In the bathroom mirror, she instructed me to repeat after her. I agreed and said the words firmly, staring at my own reflection: \"Look into my eyes. Nothing is happening right now. You haven't met anyone. You didn't talk to anyone. Everything was just your imagination. Teacup, Gamma, Lambda, and The Patriot don't exist. You're going to fall asleep, and none of this ever happened.\"</p>\n\n<p>After that, I went back to bed. I started to drift off, hearing only faint mumbles—like whispers from a distant speaker. Then, nothing. I guess I just fell asleep.</p>\n\n<p>So yeah! Could you keep up? Pretty wild, right? That spy-movie vibe still blows my mind. I debated whether I should just dismiss this whole experience, but in the end, this is how I express feelings about things I still don't understand—but that once felt so real. Maybe I rambled too much or confused you a bit. One day, I might make an abridged version of this story so it lands more clearly. Anyway, thanks again for sticking with me to the end. This one ran a little long, but I'll keep things lighter in future posts. I know I said at the start that I wouldn't share these private matters, but if you have feedback—or just want to let something out—hit me up on <a href=\"https://www.instagram.com/dot4music\">Instagram</a> DMs. I'd be glad to hear from you. Thanks again, and I'll catch you tomorrow.</p>\n\n<p>- Nano</p>",
      "song":"<iframe data-testid=\"embed-iframe\" style=\"border-radius:12px\" src=\"https://open.spotify.com/embed/track/5dZ8PeKKZJLIQAWNTdp8WX?utm_source=generator\" width=\"50%\" height=\"152\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe>"
    },
    {
      "title": "Where to begin?",
      "id": "where-to-begin",
      "date": "September 10, 2025",
      "post": "<p>Yesterday I had to run some errands for the company—mostly driving around in my car, picking up material necessary for the product we're building. I really enjoy those drives because I get to spend anywhere from 40 minutes to even 2 hours just driving around the city, thinking about what I want to do with my music and this blog. While driving on the highway I thought: \"What can I really talk about? What's too sensitive or offensive? What's considered 'crossing the line'?\" Then I thought, \"Well, let's start with something so f***ing crazy nobody would believe it. In the end, I already put that in the disclaimer today!\" Either way, I kept thinking it doesn't matter if anyone else believes it. What matters is that at least <em>The Team</em> would know it's true.</p><p>The year was 2005. I was 8 years old. We had just moved from my house in the middle of nowhere to somewhere a bit closer to society. It was a cold night—normal weather for the city I was living in. I was in my pajamas, ready to go to sleep with the shades open. To be honest, I felt comfortable like that, with the streetlights piercing through my window. I was ready to fall asleep, until I felt something in my mind—like some sort of external thought passing through it. Almost as if Professor Xavier himself was trying to read my mind. I spoke out loud: \"Hello… who are you?\" and a voice responded: \"Well, in your cousin's house I'm known simply as Teacup.\" I'm translating roughly here; the actual conversation was in Spanish, and his name was <em>Tesito</em>—which literally means \"little tea.\" I just thought Teacup sounded better.</p><p>Anyway, it wasn't as if I was just hearing a voice in my head. It was as if this voice was speaking <em>through</em> me. I was talking, but it wasn't me talking—it was Teacup. \"Oh, hi,\" I responded, my tone more curious than scared, as if the feeling was somehow familiar. Later, Teacup introduced me to his friends: \"I wanted to introduce you to my friends Gamma and Lambda.\" Each one greeted me—again, through my own voice. I remember Gamma being full of energy, saying we were going to be the best of friends. There was a kind of resignation in her tone when she said that. Gamma reminded me: \"You already know me. Your cousin and sister talked about me—that I burned with a match back at your old house.\" I said, \"Oh yeah, that you burned every part of your body.\" She snapped back, annoyed: \"NO, I ONLY BURNED MY FINGERS!\" I wanted to laugh, but I stayed serious throughout the whole encounter.</p><p>Then Lambda spoke—shy, hesitant, almost whispering: \"Hi, I'm Lambda…\"</p><p>I think I'll stop here and split this story into two parts. Not to drag it out, but because there's still more to say and I'd rather not rush it. And honestly, I know how this must sound—like some made-up fantasy or the kind of story only a crazy person would keep repeating. I've told it before, and most people just don't take it seriously. That's fine. Believe it, don't believe it—that's up to you. For me, this is real. Writing it down here is just my way of giving it one more chance to be heard. And yeah, maybe part of me is doing this because I want my album to get somewhere. Maybe this whole thing is just me being pathetic and trying to get attention. Call it self-pity, call it promotion, call it whatever you want—I don't really care anymore. At least you're still reading.</p><p>P.S: Lambda, Gamma, Alpha, and Orion… please stay until the end. I promise it's going to be worth your time.</p><p>- Nano</p>",
      "song": "<iframe data-testid=\"embed-iframe\" style=\"border-radius:12px\" src=\"https://open.spotify.com/embed/track/4xF4ZBGPZKxECeDFrqSAG4?utm_source=generator\" width=\"50%\" height=\"152\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe>"
    },
    {
      "title": "Welcome: DISCLAIMER",
      "id": "welcome-disclaimer",
      "date": "September 9, 2025",
      "post": "<p>Well, this is my personal blog, where I will be sharing my thoughts, experiences, and probably some respectful venting toward certain people whom I will not be naming explicitly. Also this is my way of \"promoting\" my new <strong><u>album</u></strong> by, God willing, early 2027. I think you can guess the title by now. Having said that, I want to point out a few things first:</p><p><strong>1.</strong> All the experiences and thoughts expressed in these future blog posts are only about 10% believable; however, the opinions I hold are, in my view, 100% true.</p><p><strong>2.</strong> As I mentioned, I will not be disclosing any personal information about these people. Instead, I've decided to identify them with Greek letters (Lambda, Gamma, Alpha, etc.). I think it's best if you know a little about each person's background to some extent (career, profession, family)—of course, without revealing too much private information.</p><p><strong>3.</strong> The people referred to by Greek letters are completely unrelated to my family, close friends, ex-girlfriends, co-workers, and so on. I will only mention people within this \"unknown\" personal circle, referred to as \"The Team\". So, if by coincidence you think that one of these people is you, let me just say: get your head out of the gutter. You are not on my mind at that moment. You'll know who you are based on the Greek letter I use.</p><p>With that said, I hope you enjoy these stories. I also want to make it clear that I will not discuss these posts with anyone privately—because I don't have the time nor patience to discuss these personal matters.</p><p>Tommorrow I'll begin my personal, raw, emotional rambling and hoping no one will worry about it<p>- Nano</p>",
      "song": "<iframe data-testid=\"embed-iframe\" style=\"border-radius:12px\" src=\"https://open.spotify.com/embed/track/57iDDD9N9tTWe75x6qhStw?utm_source=generator&theme=0\" width=\"50%\" height=\"152\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe>"
    }
  ]
}
